[
    {
        "name": "Bev Beattie",
        "stars": 4,
        "review": "One stop shop!\n\nWhat a time saver, all potential suppliers in one place... will cut out a lot of Google searching, which gives more time to get my job done!",
        "reviewDate": "2016-11-28T23:00:00.000Z"
    },
    {
        "name": "Danny Berger",
        "stars": 5,
        "review": "Extremely useful resource\n\nIn the hectic world of events we found the guys at Eventerprise invaluable.....long may it continue",
        "reviewDate": "2016-11-28T23:00:00.000Z"
    },
    {
        "name": "Julie Doucet",
        "stars": 5,
        "review": "Great idea !\n\nNice to have such a useful platform covering so many areas. Looking forward to start using it.",
        "reviewDate": "2016-11-28T23:00:00.000Z"
    },
    {
        "name": "Sue Gibson\n",
        "stars": 5,
        "review": "Sort the wheat from the chaff\n\nThe events industry is a minefield. This sounds like the perfect tool to get the best of the best in quality, professionalism & time-saving.",
        "reviewDate": "2016-11-27T23:00:00.000Z"
    },
    {
        "name": "Helen Roxburgh",
        "stars": 5,
        "review": "I am so impressed with the team at Eventerprise!\n\nI feel confident that Eventerprise will deliver according to my needs. So far they have proven to be highly focused and reliable.",
        "reviewDate": "2016-11-27T23:00:00.000Z"
    },
    {
        "name": "Caroline Evans",
        "stars": 5,
        "review": "Innovative Company\n\nGreat idea for a company..I love the whole concept .",
        "reviewDate": "2016-11-27T23:00:00.000Z"
    },
    {
        "name": "Keri",
        "stars": 5,
        "review": "Eventerprise raising the bar...\n\nA global platform was bound to happen - how Eventerprise have raised the bar in terms of facilitation, management and overall functionality - has blown us away!",
        "reviewDate": "2016-11-27T23:00:00.000Z"
    },
    {
        "name": "Sarah Jane Taylor",
        "stars": 5,
        "review": "Innovative and trusted\n\nIt is great to have a tried and tested way to get information and advice for events. Great idea and sharing platform .",
        "reviewDate": "2016-11-26T23:00:00.000Z"
    },
    {
        "name": "Trista Black",
        "stars": 5,
        "review": "A revolutionary step forward for the events industry!\n\nSuch a clever concept I cannot believe this has taken so long to do. I cannot wait to plan my next event using Eventerprise\n",
        "reviewDate": "2016-11-26T23:00:00.000Z"
    },
    {
        "name": "Carmen",
        "stars": 5,
        "review": "Magic!\n\nAt last...a 'trip advisor' for the events world, now that's truly Magical!",
        "reviewDate": "2016-11-26T23:00:00.000Z"
    },
    {
        "name": "Jane gammage",
        "stars": 4,
        "review": "A brilliant option\n\nTaking the stress out of event planning with a great service that's easy to use and backed up by a professional team.",
        "reviewDate": "2016-11-26T23:00:00.000Z"
    },
    {
        "name": "Dave Meyer",
        "stars": 5,
        "review": "Life gets easier\n\nThis site makes the onerous task putting an event together so much easier... As an event professional (which I am), it also makes finding business easier. About time!\n",
        "reviewDate": "2016-11-26T23:00:00.000Z"
    },
    {
        "name": "Gary",
        "stars": 5,
        "review": "Eventerprise rocking the UK and global events industry\n\nEventerprise are bringing the UK events industry into the 21st century truly globalising the industry with a mignificent value proposition. Never before have vendors and clients been brought together in such a dynamic and agile way. Fantastic idea awesome execution!",
        "reviewDate": "2016-11-26T23:00:00.000Z"
    },
    {
        "name": "Graham Dimond",
        "stars": 5,
        "review": "Fantastic concept\n\nA great company run by creative and quality focused people..\nThoroughly recommended!",
        "reviewDate": "2016-11-26T23:00:00.000Z"
    },
    {
        "name": "Nannette",
        "stars": 5,
        "review": "Needed\n\nWelcome and reliable new friend!! 😀",
        "reviewDate": "2016-11-26T23:00:00.000Z"
    },
    {
        "name": "Jen",
        "stars": 5,
        "review": "Wish I had thought of this\n\nGreat tool to use when planning your event, all the info and suppliers you need in one place!",
        "reviewDate": "2016-11-26T23:00:00.000Z"
    },
    {
        "name": "KMW",
        "stars": 5,
        "review": "Great platform\n\nExtraordinary market place for any events driven person, whether for professional or private occasions.",
        "reviewDate": "2016-11-25T23:00:00.000Z"
    },
    {
        "name": "Cameron Charles",
        "stars": 4,
        "review": "The real deal!\n\nExtraordinary coincidence - I've just been thrown a curve ball - the responsibility of organising the banks' end of year party!! Eventerprise lets go!",
        "reviewDate": "2016-11-25T23:00:00.000Z"
    },
    {
        "name": "Emma Victoria Wright",
        "stars": 5,
        "review": "Eventerprise is a tusted networking platform tailored specifically to the events industry.\n\nI am proud to be associated with Eventerprise. They are a dynamic and friendly team who never fail to delivery what they say they will. WELL DONE.\nEmma - Dubai, UAE.",
        "reviewDate": "2016-11-24T23:00:00.000Z"
    },
    {
        "name": "Seb Wooderson",
        "stars": 5,
        "review": "Eventerprise\n\nAmazing it has taken so long for someone to create a truly global online platform for the events industry, wonderful work and brilliant ingenuity.\n",
        "reviewDate": "2016-11-24T23:00:00.000Z"
    },
    {
        "name": "Theshowdown.",
        "stars": 5,
        "review": "Making the making of events less of an event\n\nThe concept alone got me intrigued. It was an \"aha! Of course this platform should be there\" moment. \nBut the execution is really what counts. \nCutting the headaches out of event planning does make for better events. \nCheers to the team",
        "reviewDate": "2016-11-24T23:00:00.000Z"
    },
    {
        "name": "Aiden",
        "stars": 5,
        "review": "Seamless, practical and efficient\n\nNever had a problem with Eventerprise.com",
        "reviewDate": "2016-11-24T23:00:00.000Z"
    },
    {
        "name": "Jason Sauls",
        "stars": 4,
        "review": "Ease and variety\n\nIt would seem that Enterprise is very objective when considering the capabilities of the company. I like that. Its user friendly interface also makes the whole event planning(which can usually be a stressful and tedious experience) something to to look forward to.",
        "reviewDate": "2016-11-24T23:00:00.000Z"
    },
    {
        "name": "Justin McGregor",
        "stars": 5,
        "review": "Planning an event will never be the same!\n\nWhat Eventerprise is offering to those planning an event will save them so much time and money, while providing a world class platform to successfully plan their event. I'm about to get married and struggled to find top rated suppliers... I wish we found Eventerprise just a little earlier. We'll definitely use Eventerprise for our next event!",
        "reviewDate": "2016-11-24T23:00:00.000Z"
    },
    {
        "name": "Alice Muir",
        "stars": 5,
        "review": "Brilliant idea\n\nMarket place reviews for global events industry....fantastic!!!!!",
        "reviewDate": "2016-11-24T23:00:00.000Z"
    },
    {
        "name": "Gloria Gabel",
        "stars": 5,
        "review": "Finally!!\n\nIt will revolutionize the global events industry. An unprecedented brilliant idea. Finally!!",
        "reviewDate": "2016-11-24T23:00:00.000Z"
    },
    {
        "name": "Shaun Oakes",
        "stars": 5,
        "review": "I trust Eventerprise more than I trust my mom\n\nSeamless experience, does everything it says on the label. Good job, Eventerprise.",
        "reviewDate": "2016-11-24T23:00:00.000Z"
    },
    {
        "name": "Claire Redmond",
        "stars": 5,
        "review": "Great idea\n\nAt last a pain free way to connect with customers in the event industry .",
        "reviewDate": "2016-11-23T23:00:00.000Z"
    },
    {
        "name": "Jared van der Merwe",
        "stars": 5,
        "review": "Eventerprise, a brilliant idea brought to life.\n\nIf you're planning an event and you actually want to pull it off, make it great and everything to be taken care of, I highly recommend using Eventerprise.",
        "reviewDate": "2016-11-23T23:00:00.000Z"
    },
    {
        "name": "Chris Allen",
        "stars": 5,
        "review": "Truly Helpful\n\nMy Company puts an events on for both new and existing clients, we need venues, guest speakers, music, and professional invitations to make the event memorable, with the Eventerprise platform we found exactly what we wanted ,leaving the stress away from our company , they can handle everything for us, we can then concentrate on looking after our guests.\nChris Allen IP Global. Dubai UAE",
        "reviewDate": "2016-11-23T23:00:00.000Z"
    },
    {
        "name": "James Wright",
        "stars": 5,
        "review": "Simply brilliant and very user friendly!\n\nEventerprise have clearly done their research here and created a platform that will revolutionise the event management process.",
        "reviewDate": "2016-11-23T23:00:00.000Z"
    },
    {
        "name": "Harry Yeatman-Biggs",
        "stars": 5,
        "review": "A marvellous concept.\n\nIn my experience Eventerprise is that rare thing : a company providing practical excellence of service that fully lives up to the originality of the concept behind it.",
        "reviewDate": "2016-11-23T23:00:00.000Z"
    },
    {
        "name": "Ruben van den Bosch",
        "stars": 5,
        "review": "Great service\n\ngreat service. I used it to host my birthday party and it was a great success",
        "reviewDate": "2016-11-23T23:00:00.000Z"
    },
    {
        "name": "Nola Grunder",
        "stars": 5,
        "review": "Review\n\nBest platform for anything events. Revolutionary.",
        "reviewDate": "2016-11-23T23:00:00.000Z"
    },
    {
        "name": "Anne-Fleur Snoek",
        "stars": 5,
        "review": "Great platform!\n\nGreat platform, making it easy to plan a great event!",
        "reviewDate": "2016-11-23T23:00:00.000Z"
    },
    {
        "name": "Mr David Wright",
        "stars": 5,
        "review": "Panning for the gold\n\nEventerprise makes events easier to organise, more quickly, more efficiently and certainly more cost effectively by separating out the dross and panning for the gold.",
        "reviewDate": "2016-11-23T23:00:00.000Z"
    },
    {
        "name": "Anthony Van Beek",
        "stars": 5,
        "review": "Best Event Suppliers\n\nI love that I can search for suppliers for any event which I might be organising and find the best ones, compare them based on reviews and make contact with them.\n",
        "reviewDate": "2016-11-23T23:00:00.000Z"
    },
    {
        "name": "Jane",
        "stars": 5,
        "review": "Groundbreaking\n\nOne stop shop for all your eventing needs - brilliant!!",
        "reviewDate": "2016-11-23T23:00:00.000Z"
    },
    {
        "name": "Thilo Thümecke",
        "stars": 5,
        "review": "Great platform\n\nEventerprise is such an easy to use platform and helps to find the right partners for an unforgettable event.",
        "reviewDate": "2016-11-23T23:00:00.000Z"
    },
    {
        "name": "Megan Kirkman",
        "stars": 5,
        "review": "Eventerprise is the perfect match\n\nEventerprise is a massive timesaver which takes the agony out of sourcing the right supplier for your event. Their formula: search, find, match, review, really works. Coupled to this the team is extremely professional and motivated - a pleasure to work with.\nI would not hesitate to recommend them.\n",
        "reviewDate": "2016-11-23T23:00:00.000Z"
    }
]